; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	infrared2 - mode
	thermograph0 - mode
	infrared1 - mode
	GroundStation1 - direction
	Star6 - direction
	GroundStation0 - direction
	Star7 - direction
	Star8 - direction
	GroundStation2 - direction
	Star5 - direction
	GroundStation4 - direction
	Star3 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 infrared1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument2 infrared1)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star8)
	(supports instrument4 infrared2)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
)
(:goal (and
	(pointing satellite2 Star7)
	(have_image Phenomenon9 infrared2)
	(have_image Phenomenon10 infrared1)
	(have_image Phenomenon11 infrared2)
	(have_image Planet12 infrared1)
	(have_image Star13 thermograph0)
	(have_image Phenomenon14 infrared2)
	(have_image Phenomenon15 thermograph0)
	(have_image Phenomenon16 infrared1)
))

)

; plan
1. (turn_to satellite2 star7 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 star7)
   goals met: 1 of 9
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 9
3. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 1 of 9
4. (turn_to satellite0 phenomenon14 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 9
5. (take_image satellite0 phenomenon14 instrument0 infrared2)
   added: (have_image phenomenon14 infrared2)
   goals met: 2 of 9
6. (turn_to satellite0 phenomenon11 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 9
7. (take_image satellite0 phenomenon11 instrument0 infrared2)
   added: (have_image phenomenon11 infrared2)
   goals met: 3 of 9
8. (turn_to satellite0 phenomenon10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 9
9. (take_image satellite0 phenomenon10 instrument0 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 4 of 9
10. (turn_to satellite0 phenomenon15 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon15)
   goals met: 4 of 9
11. (take_image satellite0 phenomenon15 instrument0 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 5 of 9
12. (turn_to satellite0 phenomenon16 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon16)
   goals met: 5 of 9
13. (take_image satellite0 phenomenon16 instrument0 infrared1)
   added: (have_image phenomenon16 infrared1)
   goals met: 6 of 9
14. (turn_to satellite0 phenomenon9 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon9)
   goals met: 6 of 9
15. (take_image satellite0 phenomenon9 instrument0 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 7 of 9
16. (turn_to satellite0 planet12 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet12)
   goals met: 7 of 9
17. (take_image satellite0 planet12 instrument0 infrared1)
   added: (have_image planet12 infrared1)
   goals met: 8 of 9
18. (turn_to satellite0 star13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star13)
   goals met: 8 of 9
19. (take_image satellite0 star13 instrument0 thermograph0)
   added: (have_image star13 thermograph0)
   goals met: 9 of 9
